BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
Measurement getMeasurements(void){
  //Turns sensors on, take measurements, format them and return.
  Measurement m;
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);  
  //GET MEASUREMENTS
  m.timestamp=rtcmem.getCurrentTime();  //Put current timestamp
  m.id_sensor[0] = 1;   //Read sensor number from configuration file.
  m.id_sensor[1] = 2; 
  m.id_sensor[2] = 3; 
  m.id_sensor[3] = 4;
  m.temperature[0] = generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
  m.temperature[1] = generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2] = generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3] = generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0] = generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());; 
  m.humidity[1] = generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());; 
  m.humidity[2] = generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());; 
  m.humidity[3] = generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());;  

  setSensorPower(OFF);

  return(m);
}

String generatePOSTRequest(void* data, uint16_t packets){
  /*This function receives data saved to flash (array) and generates the POST request to send
    it to the server, which is returned.
    Necessary data:
  */
  
  String request="";  //Initialize empty string.
  String values_timestamp=  "[";
  String values_id_sensor=  "[";
  String values_temperature="[";
  String values_humidity=   "[";

  Measurement m;  //Temporary variable.
  for (uint16_t p = 0; p < packets; p++){ //For each packet...
    memcpy(&m, data+(p * sizeof(m)), sizeof(m));    //Copies one packet into the temporary memory.

    for (uint8_t s = 0; s < DATALOGGER_SENSOR_COUNT; s++){ //For each sensor...
      values_timestamp+= (String)m.timestamp;
      values_id_sensor  +=(String)m.id_sensor[s];
      values_temperature+=(String)m.temperature[s];
      values_humidity   +=(String)m.humidity[s];

      if( p < packets-1){   //If it is not the last packet...
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
      }
      else{   //If it is the last element, closes the bracket.
        if(s < DATALOGGER_SENSOR_COUNT - 1){
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
        }  
        else{
          values_timestamp+=  "]";      
          values_id_sensor+=  "]";      
          values_temperature+="]";      
          values_humidity+=   "]"; 
        } 
      }
    }
  }
  
  request += "id_transceiver=1";      //? symbol deleted as it is not needed into POST method.
  request += "&battery_level="+(String)getBatteryLevel();
  request += "&timestamp="+   values_timestamp;
  request += "&id_sensor="+   values_id_sensor;
  request += "&temperature="+ values_temperature;
  request += "&humidity="+    values_humidity; 
  
  // Serial.print("\n Generated POST request: ");
  // Serial.println(request);  
  
  return request;
}

uint16_t sendMeasurements(uint16_t start_packet, uint16_t packets){
  /*
      This function takes data packets and sends them to the server.
      "packets" default value is 0, so if not specified in function call, it will send all the
      pending packets instead of the amount specified. 
  */

  uint32_t start_time = millis(); //Saves start time.
  uint32_t connection_start_time, server_start_time, request_start_time;
  

  //If won't exceed the maximum and the amount is not 0...
  if( start_packet+packets < rtcmem.rwVariables().archive_saved_pointer){
    
    StateMachine conn_machine(1);
    bool sendpackets=true;
    bool isconnected=false;

    WiFiClient client;
    HTTPClient http;
    uint8_t buf[sizeof(Measurement)*MAX_PACKET_PER_REQUEST];
    uint16_t sent_packets_amount=0;
    //Generate full URL.
    String url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
    url+=SEND_MEASUREMENTS_URL;
    Serial.print("\n url: ");   Serial.println(url);

    while(sendpackets){

      if (conn_machine.getState() == 1){    //Network connection...
        if(conn_machine.stateInit()){
          sendpackets = true;
          wifiTurnOn();                     //Turn wifi on.
          Serial.setDebugOutput(true);  //DEBUG
          WiFiMulti.addAP(config_globals.server_ap_ssid, config_globals.server_ap_pass);  //Connects to WiFi network.
          connection_start_time=millis();               //Start counting for network connection timeout.
          Serial.print("\nConnecting to network...\n ");
        }

        if( (millis() - connection_start_time) < config_globals.connection_timeout ){  //If not timed out...
          if ((WiFiMulti.run() == WL_CONNECTED)){   //Checks if connection successful.
            Serial.printf("\nWiFi Connected!");
            isconnected=true; //Toggle flag.
            conn_machine.setState(2);   //Goes to server connection.
          }
        }
        else{
          //Notice timeout
          Serial.print("\n Unable to connect to network. data not sent.");
          sendpackets = false;  //break loop.
        }
        
        
      }
      else if (conn_machine.getState() == 2){ //Server connection...
        if(conn_machine.stateInit()){
          Serial.print("\nConnecting to server...\n");
          server_start_time = millis();      //Start counting for request timeout...
        }
          //here's the problem.
        if( (millis() - server_start_time) < config_globals.response_timeout ){  //If server connection doesn't timeout...
          if (http.begin(client, url)){
            conn_machine.setState(3);     //Goes to send packets state...
          }
          else{
            Serial.print(".");
            delay(10);
          }
        }
        else{
          //Notice timeout
          Serial.print("\n Unable to find server. data not sent.");
          sendpackets = false;  //break loop.
        }
      }
      else if (conn_machine.getState() == 3){ //Send packets.
        
        if(conn_machine.stateInit()){/////////////////////// PUT TIMEOUT HERE AS WELL, it gets stuck when server won't respond.
          /*  uint16_t end_packet, s, e;
            s = start_packet;
            end_packet = start_packet + packets;
            e = s + MAX_PACKET_PER_REQUEST;
            while (e != end_packet){
              if(e > end_packet)
                e = end_packet;

              archiveRead(buf, s, e);
              e = s + MAX_PACKET_PER_REQUEST;   
              s=e+1;  //Next initial packet is the last one +1.
            } 
          */
          request_start_time = millis();
          uint8_t retries = 0;
          uint16_t end_packet, i, n, pending_packets;

          if(packets == 0){ //Initialization of start and final packets index.
            start_packet = rtcmem.rwVariables().archive_sent_pointer; //The last sent packet following one.
            end_packet = rtcmem.rwVariables().archive_saved_pointer-1;    //The last saved packet into archive (maximum).
          }
          else{ 
            end_packet = start_packet + packets;
            if(end_packet > rtcmem.rwVariables().archive_saved_pointer-1)
              end_packet = rtcmem.rwVariables().archive_saved_pointer-1;
          }

          i = start_packet;
          n = MAX_PACKET_PER_REQUEST;
          if(i+n > end_packet)    //Limit the amount of packets to read if there are less than the maximum.
            n = end_packet-i; //Equals to pending packets.


