BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
//possibly the error is here... (in this while()).
/*Packets iteration is working fine, but when first request is sent and pointers ("i" and "n")
  are updated and the loop starts again, it's not entering to it.

  check the first condition: i+n < end_packet.
     In the last cycle (when n=0 as there is no pending packets)
    the condition will be false, as i-0 = i => i = end_packet -> false.

    -> The condition is wrong, it will never enter when i+n would happen to be equal to end_packet
    in the first cycle...

    in "logs 3.txt": it can be seen that in the last packet, the condition will be false, 
    as i=168 and n=12, i+n = 180 -> false.

*/
          while(i+n < end_packet && retries < config_globals.connection_retry){
            //TX
            //await response, continue iterating if OK, or retry if not (increment retry counter)
            // iteration: i+=n;  //"i" is now the last read packet +1.
            Serial.printf("\nstart_packet=%d  /  end_packet=%d", start_packet, end_packet);
            Serial.printf("\nPacket iterator:\n i=%d  /  n=%d", i, n);

            archiveRead(buf, i, n); //Read "n" packets starting from packet number "i"

            String request = generatePOSTRequest(buf, n); //Generate request with n elements.
            Serial.print("[HTTP] POST...:\n");  Serial.print(request);
            int httpCode = http.POST( request );    //Send POST request.

            if (httpCode > 0){  //If > 0, the server got the request and is sending this response code.
              Serial.printf("\n[HTTP] POST... response code: %d\n", httpCode);  //HTTP response...
              
              if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY){
                String payload = http.getString();  Serial.println(payload);
                sent_packets_amount += n;

                i += n;  //"i" is now the last read packet.
                n = MAX_PACKET_PER_REQUEST;
                if(i+n > end_packet)    //Limit the amount of packets to read if there are less than the maximum.
                  n = end_packet-i; //equal n to que amount of pending packets.
                
                Serial.printf("\n      DATA SENT. Packets pending: %d", end_packet-i);
                Serial.printf("\n  Packets in next request: %d", n);
                Serial.printf("\n  i=%d  /  n=%d", i, n);

                retries=0;
              }
              else{
                retries++;
                Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
              }
            }
            else
              retries++;
            yield();
          }
          sendpackets = false;


          
          

         



          http.end(); //See if this will kill the ongoing connection...
        }
      }
      yield();  //yield in every loop...
    }
    wifiTurnOff();  //Turn wifi off after sending all the packets.
    return sent_packets_amount;
  } 
  else{
    wifiTurnOff();
    return 0;
  }
  
  // Serial.setDebugOutput(false);
  
  // Serial.printf("\n Time taken: %dms.", (int)(millis() - start_time));
}

uint32_t getServerTimeUnix(void){
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  if(time > 3600000000 ) time = 3600000000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000000;
 
  rtcmem.setElapsedTime(t+(millis()/1000));

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN, HIGH);  //Turn sensors supply off.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won't turn on automatically until required.
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  delay(1);
  WiFi.forceSleepBegin(); 
  delay(1);
}

void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  void* p = &config_globals;
  uint8_t buf[sizeof(Config_globals)]; //temporary buffer.

