BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  File file = SPIFFS.open(CONFIG_FILE_NAME, "r");   //Open file
  if (file){        //If file opens correctly...
     
    Serial.print("\n  Config_globals: ");  
    for (uint16_t i = 0; i < sizeof(buf); i++)
    {
      buf[i] = file.read(); //Copies the read byte 
      Serial.printf("%X ",  buf[i]);
    } 
    memcpy(p, buf, sizeof(buf));  //Copies read data to the variable.
    // rwVariables();  //Stores read data to RTC memory.    ////////////////// REMOVED FOR TESTING ///////////
    return true;
  }
  else{     //Load default values.
    strcpy(config_globals.server_ap_ssid,"DATALOGGER SERVER");
    strcpy(config_globals.server_ap_pass,"!UBA12345!");
    strcpy(config_globals.server_ip, "192.168.137.1");
    strcpy(config_globals.local_ip,"192.168.4.1");
    strcpy(config_globals.wifi_security_type,"WPA2");

    config_globals.server_port=8080;
    config_globals.connection_retry=1;
    config_globals.connection_timeout=10000;
    config_globals.server_connection_timeout=2000;
    config_globals.response_timeout=5000;
    config_globals.id_transceiver=1;
    config_globals.id_sensor_1=1;
    config_globals.id_sensor_2=2;
    config_globals.id_sensor_3=3;
    config_globals.id_sensor_4=4;
    config_globals.sample_time=3600;
  }
  return false;
}

//////////////////////////// WEB SERVER FUNCTIONS /////////////////////////////////
unsigned char runWebServer(void){ 

  String ap_ssid="Datalogger";
  String ap_pssw="123456789!";
  
  //IPAddress local_IP(192,168,2,2);  //192.168.2.2
  //IPAddress gateway(192,168,2,1);   //192.168.2.1
  //IPAddress subnet(255,255,255,0);  //255.255.255.255
  //WiFi.softAPConfig(local_IP, gateway, subnet);
  
  WiFi.mode(WIFI_AP);
  while(!WiFi.softAP(ap_ssid, ap_pssw))
  {
    Serial.println(".");
    delay(100);
  }
  
  // Iniciar servidor
  server.begin();
  Serial.println("HTTP server started");

  Serial.println("");
  Serial.print("Initialized AP:\t");
  Serial.println(ap_ssid);
  Serial.print("IP address:\t");
  Serial.println(WiFi.softAPIP());
  Serial.print("MAC address:\t");
  Serial.println(WiFi.macAddress());
 
  
  server.on("/",handleHome);
  server.on("/change_network_config", handleChangeNetworkConfig);
  server.on("/change_server_config", handleChangeServerConfig);
  server.on("/format_ram",handleFormatRam);
  server.on("/format_flash",handleFormatFlash);

  return(1);
}

void handleHome(void){
  Serial.print("/");
  //Returns main page.
  server.send(200, "text/html", index_html);
}

void handleChangeNetworkConfig(void){
    Serial.print("/change_network_config");
    String new_ssid, new_password;
    
    if (server.hasArg("new_ssid") && server.hasArg("new_password"))
    {
        new_ssid = server.arg("new_ssid");
        new_password = server.arg("new_password");
        //Change parameters in Flash config file.

        server.send(200, "text/plain", "Network credentials modified correctly.");
        // Serial.printf("\nNetwork credentials modified:\nSSID:%s\nPass:%s",new_ssid,new_password);
    }
    else
    {
        server.send(200, "text/html", "ERROR: Wrong parameters.");
    }

  // uint8_t buf[RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4]; //24 Bytes
  // readDataFromFlash(MEASUREMENTS_FILE_NAME, 0, buf, sizeof(buf));

  Measurement m;  
  for (uint16 i = 0; i < 12; i++)
  {
    // readDataFromFlash(MEASUREMENTS_FILE_NAME, i*RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4, &m, sizeof(buf));
    archiveRead(&m, i, i);
    Serial.printf("\nRead measurements from flash:   (index: %d)   data: \n",i*RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4);
    Serial.printf("\ntimestamp: %d\n",m.timestamp);
    Serial.printf("id_sen sor: [%d,%d,%d,%d] \n",m.id_sensor[0],m.id_sensor[1],m.id_sensor[2],m.id_sensor[3]);
    Serial.printf("temperature: [%d,%d,%d,%d] \n",m.temperature[0],m.temperature[1],m.temperature[2],m.temperature[3]);
    Serial.printf("humidity: [%d,%d,%d,%d] \n",m.humidity[0],m.humidity[1],m.humidity[2],m.humidity[3]);
    Serial.print("----------------------------------\n\n");
  }
 
  Serial.printf("\nArchive pointer: %d", archiveGetPointer());

}

void handleChangeServerConfig(void){
  Serial.print("/change_server_config");
  String new_ip, new_port;
  
  if (server.hasArg("ip") && server.hasArg("port"))
  {
      new_ip = server.arg("new_ip");
      new_port = server.arg("new_port");
      /* Validate ip and port number */

      //Change parameters in Flash config file.
      server.send(200, "text/plain", "Server parameters modified correctly.");
      // Serial.printf("\nServer parameters modified:\nIP:%s\nPort:%s",new_ip,new_port);
  }
  else
  {
      server.send(200, "text/html", "ERROR: Wrong parameters.");
  } 
}

unsigned char handleFormatRam(void){
  if (server.hasArg("command"))
  {
    if(server.arg("command") == "format_confirm"){
      /*Call to format RAM*/
      rtcmem.clear();                   //Reset values to dafault.
      rtcmem.safeDisconnect();          //Saves current values in NVM.
      Serial.printf("RAM Formatted.");
      server.send(200, "text/plain", "Server parameters modified correctly.");

      return(1);  //Returns 1 to inform that RAM has been erased correctly. This should drive to a reboot.
    }
  }
  server.send(200, "text/html", "ERROR: Wrong parameters.");
  return(0);  //Returns 1 to inform that RAM has NOT been erased correctly.
}

unsigned char handleFormatFlash(void){
  
  if(SPIFFS.remove(MEASUREMENTS_FILE_NAME)){    //Delete file.
    //SPIFFS.format();
    SPIFFS.remove(NVM_POINTERS_FILE_NAME);    //Delete variables backup.
    SPIFFS.remove(CONFIG_FILE_NAME);          //Delete 
    Serial.printf("\nFLASH Formatted.\n");

    rtcmem.clear();             //Write default values into rtc memory.
    rtcmem.safeDisconnect();    //Saves default values into NVM.

    return(1);  //Returns 1 to inform that FLASH has been erased correctly. This should drive to a reboot.
  }
  else return 0;

}

bool handleChangeConfig(void){
  /*
    Open configuration file (JSON) and overwrite the values received. 
    If any entry is invalid or blank/null, don't overwrite it.
    Also data should be validated from both browser (Javascript code) 
    and this function too, in order to avoid errors.
  */
 
  void* p = &config_globals;

  File file = SPIFFS.open(CONFIG_FILE_NAME, "w");
  if (file) {       //If file opened correctly...

      Serial.printf("\nglobals saved:");
      for (uint16 i = 0; i < sizeof(config_globals); i++)
      {
        Serial.printf("%X ", ((const char*)p)[i]);
      }

      file.write((const char*)(p), sizeof(Variables)); //Overwrites previous data.
      file.close();
      return true;
  }

